## Plan Result (prod-frontdoor)




<pre><code>Plan: 71 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.frontdoor_for_testing_migration.azurerm_frontdoor.main
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;c100-application&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;casetracker&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;certificatedbailiffs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;court-tribunal-hearings&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;court-tribunal-hearings-b2c-sign-in&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;court-tribunal-hearings-b2c-staff&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;courtfines&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dts-legacy-apps---certificatedbailiffs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dts-legacy-apps---civilappeals-casetracker&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dts-legacy-apps---courtfines&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dts-legacy-apps---immigration-appeals-iacfees&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dts-legacy-apps---redirect-service&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dts-legacy-apps---utiac&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;ejudiciary-home&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;ejudiciary-home-apex&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;ejudiciary-home-www&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;immigrationappealsonline&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;jd-bureau&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;jd-reply-jury-summons&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;pip-frontend&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;portal&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-admin-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-care-standards&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-cicap&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-employment-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-finance-tax&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-immigration-svcs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-info-rights&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-land-reg-division&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-lands-chamber&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;trib-tansport-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;tribunalsdecisions&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;c100-application&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;casetracker&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;certificatedbailiffs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;court-tribunal-hearings&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;court-tribunal-hearings-b2c-sign-in&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;court-tribunal-hearings-b2c-staff&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;courtfines&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dts-legacy-apps---certificatedbailiffs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dts-legacy-apps---civilappeals-casetracker&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dts-legacy-apps---courtfines&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dts-legacy-apps---immigration-appeals-iacfees&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dts-legacy-apps---redirect-service&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dts-legacy-apps---utiac&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;immigrationappealsonline&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;jd-bureau&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;jd-reply-jury-summons&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;portal&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-admin-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-care-standards&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-cicap&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-employment-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-finance-tax&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-immigration-svcs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-info-rights&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-land-reg-division&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-lands-chamber&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;trib-tansport-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;tribunalsdecisions&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontdoor_for_testing_migration.azurerm_frontdoor.main will be created
  + resource "azurerm_frontdoor" "main" {
      + backend_pool_health_probes           = (known after apply)
      + backend_pool_load_balancing_settings = (known after apply)
      + backend_pools                        = (known after apply)
      + cname                                = (known after apply)
      + explicit_resource_order              = (known after apply)
      + friendly_name                        = "hmcts-test-sbox"
      + frontend_endpoints                   = (known after apply)
      + header_frontdoor_id                  = (known after apply)
      + id                                   = (known after apply)
      + load_balancer_enabled                = true
      + name                                 = "hmcts-test-sbox"
      + resource_group_name                  = "lz-prod-rg"
      + routing_rules                        = (known after apply)
      + tags                                 = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + backend_pool {
          + health_probe_name   = "defaultHealthProbe"
          + id                  = (known after apply)
          + load_balancing_name = "defaultLoadBalancing"
          + name                = "defaultBackend"

          + backend {
              + address     = "www.bing.com"
              + enabled     = true
              + host_header = "www.bing.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dts-legacy-apps---certificatedbailiffs"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dts-legacy-apps---certificatedbailiffs"
          + name                = "dts-legacy-apps---certificatedbailiffs"

          + backend {
              + address     = "dualstack.certi-loadb-q2s48nuaqsc6-1478330638.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "waf.certificatedbailiffs.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dts-legacy-apps---civilappeals-casetracker"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dts-legacy-apps---civilappeals-casetracker"
          + name                = "dts-legacy-apps---civilappeals-casetracker"

          + backend {
              + address     = "dualstack.civil-loadb-qvbu457dp1b-1835055660.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "waf.casetracker.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dts-legacy-apps---courtfines"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dts-legacy-apps---courtfines"
          + name                = "dts-legacy-apps---courtfines"

          + backend {
              + address     = "dualstack.court-loadb-8mcola2l2by0-173012739.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "waf.courtfines.direct.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dts-legacy-apps---immigration-appeals-iacfees"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dts-legacy-apps---immigration-appeals-iacfees"
          + name                = "dts-legacy-apps---immigration-appeals-iacfees"

          + backend {
              + address     = "dualstack.iacfees-p-elbhmcts-6jxi2y1j3cgc-1579084157.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "waf.immigrationappealsonline.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dts-legacy-apps---redirect-service"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dts-legacy-apps---redirect-service"
          + name                = "dts-legacy-apps---redirect-service"

          + backend {
              + address     = "52.30.196.9"
              + enabled     = true
              + host_header = "proxywaf.digital.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dts-legacy-apps---utiac"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dts-legacy-apps---utiac"
          + name                = "dts-legacy-apps---utiac"

          + backend {
              + address     = "dualstack.dsd-apps-lb-01-1379550980.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "waf.tribunalsdecisions.service.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-casetracker"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-casetracker"
          + name                = "casetracker"

          + backend {
              + address     = "dualstack.civil-loadb-qvbu457dp1b-1835055660.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "casetracker.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-certificatedbailiffs"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-certificatedbailiffs"
          + name                = "certificatedbailiffs"

          + backend {
              + address     = "dualstack.certi-loadb-q2s48nuaqsc6-1478330638.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "certificatedbailiffs.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-courtfines"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-courtfines"
          + name                = "courtfines"

          + backend {
              + address     = "dualstack.court-loadb-8mcola2l2by0-173012739.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "courtfines.direct.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-immigrationappealsonline"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-immigrationappealsonline"
          + name                = "immigrationappealsonline"

          + backend {
              + address     = "dualstack.iacfees-p-elbhmcts-6jxi2y1j3cgc-1579084157.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "immigrationappealsonline.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-tribunalsdecisions"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-tribunalsdecisions"
          + name                = "tribunalsdecisions"

          + backend {
              + address     = "dualstack.dtsla-utiac-lb-prod-1989357889.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "tribunalsdecisions.service.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-land-reg-division"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-land-reg-division"
          + name                = "trib-land-reg-division"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "landregistrationdivision.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-immigration-svcs"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-immigration-svcs"
          + name                = "trib-immigration-svcs"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "immigrationservices.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-info-rights"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-info-rights"
          + name                = "trib-info-rights"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "informationrights.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-admin-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-admin-appeals"
          + name                = "trib-admin-appeals"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "administrativeappeals.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-care-standards"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-care-standards"
          + name                = "trib-care-standards"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "carestandards.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-lands-chamber"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-lands-chamber"
          + name                = "trib-lands-chamber"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "landschamber.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-finance-tax"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-finance-tax"
          + name                = "trib-finance-tax"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "financeandtax.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-employment-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-employment-appeals"
          + name                = "trib-employment-appeals"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "employmentappeals.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-tansport-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-tansport-appeals"
          + name                = "trib-tansport-appeals"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "transportappeals.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-trib-cicap"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-trib-cicap"
          + name                = "trib-cicap"

          + backend {
              + address     = "dts-tribs-prod-1612499966.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "cicap.decisions.tribunals.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-jd-bureau"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-jd-bureau"
          + name                = "jd-bureau"

          + backend {
              + address     = "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "juror-bureau.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-jd-reply-jury-summons"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-jd-reply-jury-summons"
          + name                = "jd-reply-jury-summons"

          + backend {
              + address     = "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "reply-jury-summons.service.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pip-frontend"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-pip-frontend"
          + name                = "pip-frontend"

          + backend {
              + address     = "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pip-frontend.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-court-tribunal-hearings"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-court-tribunal-hearings"
          + name                = "court-tribunal-hearings"

          + backend {
              + address     = "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "www.court-tribunal-hearings.service.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-court-tribunal-hearings-b2c-sign-in"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-court-tribunal-hearings-b2c-sign-in"
          + name                = "court-tribunal-hearings-b2c-sign-in"

          + backend {
              + address     = "hmctspipprod.b2clogin.com"
              + enabled     = true
              + host_header = "hmctspipprod.b2clogin.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-court-tribunal-hearings-b2c-staff"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-court-tribunal-hearings-b2c-staff"
          + name                = "court-tribunal-hearings-b2c-staff"

          + backend {
              + address     = "hmctspipprod.b2clogin.com"
              + enabled     = true
              + host_header = "hmctspipprod.b2clogin.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-video-web"


# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

rue
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "tribcicapsbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                  + "/Secure",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["trib-employment-appeals"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "tribemploymentappealssbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                  + "/Secure",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["trib-finance-tax"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "tribfinancetaxsbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                  + "/Secure",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "InitialBodyContents"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "txtClaimant"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }

          + override {
              + rule_group_name = "LFI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "930110"
                }
            }
          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942430"
                }
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["trib-immigration-svcs"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "tribimmigrationsvcssbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                  + "/Secure",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["trib-info-rights"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "tribinforightssbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                  + "/Secure",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__EVENTVALIDATION"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "ddlTax3"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "ddlTax2"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["trib-land-reg-division"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "triblandregdivisionsbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                  + "/Secure",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "ddlScat1"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__EVENTVALIDATION"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["trib-lands-chamber"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "triblandschambersbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                  + "/Secure",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["trib-tansport-appeals"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "tribtansportappealssbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                  + "/Secure",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["tribunalsdecisions"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "tribunalsdecisionssbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhadminwebsbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebsbox"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

Plan: 71 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":475,"Program":"tfcmt","SHA1":"","Target":"prod-frontdoor","Vars":{}} -->